In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [49]:
#make display smaller 
pd.options.display.max_rows = 10

In [14]:
unames = ['user_id' , 'gender' , 'age' , 'occupation' , 'zip']
users = pd.read_table('users.dat',sep='::' ,header = None, names = unames)

C:\Users\mohamedhassan\anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [35]:
rnames = ['user_id', 'movie_id' , 'rating' , 'timestamp']
ratings = pd.read_table('ratings.dat' , sep='::' , header=None , names = rnames)

C:\Users\mohamedhassan\anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [36]:
some = pd.merge(ratings , users)

In [38]:
movies = pd.read_table('movies.dat' , sep='::' ,  header=None , names = ['movie_id','title' , 'genres'])

C:\Users\mohamedhassan\anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [39]:
ratings

         user_id  movie_id  rating  timestamp
0              1      1193       5  978300760
1              1       661       3  978302109
...          ...       ...     ...        ...
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[1000209 rows x 4 columns]

In [66]:
data = pd.merge(pd.merge(ratings,users),movies)

In [67]:
mean_ratings = data.pivot_table('rating' , index='title' ,columns='gender', aggfunc='mean')

In [68]:
mean_ratings.sort_values(by='F',ascending=False)

gender                                               F         M
title
Clean Slate (Coup de Torchon) (1981)               5.0  3.857143
Ballad of Narayama, The (Narayama Bushiko) (1958)  5.0  3.428571
Raw Deal (1948)                                    5.0  3.307692
Bittersweet Motel (2000)                           5.0       NaN
Skipped Parts (2000)                               5.0  4.000000
...                                                ...       ...
With Friends Like These... (1998)                  NaN  4.000000
Wooden Man's Bride, The (Wu Kui) (1994)            NaN  3.000000
Year of the Horse (1997)                           NaN  3.250000
Zachariah (1971)                                   NaN  3.500000
Zero Kelvin (Kjوrlighetens kjّtere) (1995)         NaN  3.500000

[3706 rows x 2 columns]

In [69]:
rating_by_title = data.groupby('title').size()

In [70]:
rating_by_title.head(10)

title
$1,000,000 Duck (1971)                37
'Night Mother (1986)                  70
'Til There Was You (1997)             52
'burbs, The (1989)                   303
...And Justice for All (1979)        199
1-900 (1994)                           2
10 Things I Hate About You (1999)    700
101 Dalmatians (1961)                565
101 Dalmatians (1996)                364
12 Angry Men (1957)                  616
dtype: int64

In [71]:
active_titles = rating_by_title.index[rating_by_title > 250] #its arandom number the 250 but it seems to be good enough to really judge the film u know

In [72]:
active_titles

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)', '12 Angry Men (1957)',
       '13th Warrior, The (1999)', '2 Days in the Valley (1996)',
       '20,000 Leagues Under the Sea (1954)', '2001: A Space Odyssey (1968)',
       '2010 (1984)',
       ...
       'X-Men (2000)', 'Year of Living Dangerously (1982)',
       'Yellow Submarine (1968)', 'You've Got Mail (1998)',
       'Young Frankenstein (1974)', 'Young Guns (1988)',
       'Young Guns II (1990)', 'Young Sherlock Holmes (1985)',
       'Zero Effect (1998)', 'eXistenZ (1999)'],
      dtype='object', name='title', length=1214)

In [73]:
# mean_ratings = mean_ratings[mean_ratings.index.isin(active_titles)]
mean_ratings = mean_ratings.loc[actvie_titles]
#both the prev. lines are equal as a functionalits .. but .loc is better regarding to performance wise

NameError: name 'actvie_titles' is not defined

In [74]:
mean_ratings

gender                                             F         M
title
$1,000,000 Duck (1971)                      3.375000  2.761905
'Night Mother (1986)                        3.388889  3.352941
'Til There Was You (1997)                   2.675676  2.733333
'burbs, The (1989)                          2.793478  2.962085
...And Justice for All (1979)               3.828571  3.689024
...                                              ...       ...
Zed & Two Noughts, A (1985)                 3.500000  3.380952
Zero Effect (1998)                          3.864407  3.723140
Zero Kelvin (Kjوrlighetens kjّtere) (1995)       NaN  3.500000
Zeus and Roxanne (1997)                     2.777778  2.357143
eXistenZ (1999)                             3.098592  3.289086

[3706 rows x 2 columns]

In [75]:
top_female_ratings = mean_ratings.sort_values(by='F', ascending=False)

In [76]:
top_female_ratings.head(10)

gender                                               F         M
title
Clean Slate (Coup de Torchon) (1981)               5.0  3.857143
Ballad of Narayama, The (Narayama Bushiko) (1958)  5.0  3.428571
Raw Deal (1948)                                    5.0  3.307692
Bittersweet Motel (2000)                           5.0       NaN
Skipped Parts (2000)                               5.0  4.000000
Lamerica (1994)                                    5.0  4.666667
Gambler, The (A Jلtékos) (1997)                    5.0  3.166667
Brother, Can You Spare a Dime? (1975)              5.0  3.642857
Ayn Rand: A Sense of Life (1997)                   5.0  4.000000
24 7: Twenty Four Seven (1997)                     5.0  3.750000

In [83]:
mean_ratings['diff'] = mean_ratings['M'] - mean_ratings['F']

In [84]:
sorted_by_diff = mean_ratings.sort_values(by='diff')

In [85]:
sorted_by_diff[::-1][:10]

gender                                       F         M  diff
title
Zero Kelvin (Kjوrlighetens kjّtere) (1995) NaN  3.500000   NaN
Zachariah (1971)                           NaN  3.500000   NaN
Year of the Horse (1997)                   NaN  3.250000   NaN
Wooden Man's Bride, The (Wu Kui) (1994)    NaN  3.000000   NaN
With Friends Like These... (1998)          NaN  4.000000   NaN
With Byrd at the South Pole (1930)         NaN  2.000000   NaN
Wings of Courage (1995)                    NaN  3.000000   NaN
Windows (1980)                             NaN  1.000000   NaN
Wild Bill (1995)                           NaN  3.146341   NaN
White Boys (1999)                          NaN  1.000000   NaN

In [86]:
rating_std_by_titles = data.groupby('title')['rating'].std()

In [87]:
rating_std_by_titles = rating_std_by_titles.loc[active_titles]

In [90]:
rating_std_by_titles.sort_values(ascending=False)[:10]

title
Dumb & Dumber (1994)                     1.321333
Blair Witch Project, The (1999)          1.316368
Natural Born Killers (1994)              1.307198
Tank Girl (1995)                         1.277695
Rocky Horror Picture Show, The (1975)    1.260177
Eyes Wide Shut (1999)                    1.259624
Evita (1996)                             1.253631
Billy Madison (1995)                     1.249970
Fear and Loathing in Las Vegas (1998)    1.246408
Bicentennial Man (1999)                  1.245533
Name: rating, dtype: float64